In [ ]:
import pandas as pd
import numpy as np
from pathlib import Path

In [ ]:
# from google.colab import drive
# drive.mount('/content/drive')

In [ ]:
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import session
from sqlalchemy import create_engine, func

In [ ]:
# password = "BrAcRfSky6syf8M"
from getpass import getpass
password = getpass('Enter database password')
username="postgres"
db_string = f"postgresql://{username}:{password}@database-group8.cinukpl9yba8.us-east-2.rds.amazonaws.com"

In [ ]:
engine = create_engine(db_string)

In [ ]:
# read in data by borough and year, add year column, select target columns,
# concatenate by borough then concatenate for whole city with new index

boroughs = ["Bronx", "Brooklyn", "Manhattan", "Queens", "StatenIsland"]
city_df = []
1
for borough in boroughs:
  city_df.append(pd.read_sql(f'SELECT * FROM public.\"{borough}Full\"',engine))

city_df = pd.concat(city_df,ignore_index=True)

city_df = city_df[["Borough", "Neighborhood", "Building_Class_Category", "Address", "Apartment_Number", 
                            "Zip_Code", "Residential_Units", 
                            "Gross_Square_Feet", 
                            "Sale_Price", "Sale_Date"]]

In [ ]:
city_df.head()

   Borough Neighborhood  ... Sale_Price   Sale_Date
0        2     BATHGATE  ...          0  2017-04-04
1        2     BATHGATE  ...     305000  2017-07-18
2        2     BATHGATE  ...     178000  2017-01-19
3        2     BATHGATE  ...     449000  2017-07-14
4        2     BATHGATE  ...     140000  2017-05-12

[5 rows x 10 columns]

In [ ]:
city_df["Year"] = pd.DatetimeIndex(city_df["Sale_Date"]).year
city_df["Month"] = pd.DatetimeIndex(city_df["Sale_Date"]).month

In [ ]:
# drop value incompatible with integer 
#value = city_df[city_df["Sale_Price"]=="2210000000"]
#value
#city_df.drop(city_df[city_df["Sale_Price"]=="2210000000"].index, inplace=True)

In [ ]:
city_df.dtypes

Borough                     int64
Neighborhood               object
Building_Class_Category    object
Address                    object
Apartment_Number           object
Zip_Code                    int64
Residential_Units           int64
Gross_Square_Feet           int64
Sale_Price                  int64
Sale_Date                  object
Year                        int64
Month                       int64
dtype: object

In [ ]:
null_summary = city_df.isnull().groupby(by=[city_df.Borough, city_df.Year], dropna=False).sum()
pd.set_option('max_rows', 100)

In [ ]:
city_df.Building_Class_Category.unique()

array(['01 ONE FAMILY DWELLINGS                    ',
       '02 TWO FAMILY DWELLINGS                    ',
       '03 THREE FAMILY DWELLINGS                  ',
       '07 RENTALS - WALKUP APARTMENTS             ',
       '09 COOPS - WALKUP APARTMENTS               ',
       '10 COOPS - ELEVATOR APARTMENTS             ',
       '14 RENTALS - 4-10 UNIT                     ',
       '21 OFFICE BUILDINGS                        ',
       '22 STORE BUILDINGS                         ',
       '27 FACTORIES                               ',
       '29 COMMERCIAL GARAGES                      ',
       '30 WAREHOUSES                              ',
       '31 COMMERCIAL VACANT LAND                  ',
       '37 RELIGIOUS FACILITIES                    ',
       '04 TAX CLASS 1 CONDOS                      ',
       '05 TAX CLASS 1 VACANT LAND                 ',
       '06 TAX CLASS 1 - OTHER                     ',
       '08 RENTALS - ELEVATOR APARTMENTS           ',
       '41 TAX CLASS 4 - OTHER                     ',
       '44 CONDO PARKING                           ',
       '12 CONDOS - WALKUP APARTMENTS              ',
       '17 CONDO COOPS                             ',
       '33 EDUCATIONAL FACILITIES                  ',
       '13 CONDOS - ELEVATOR APARTMENTS            ',
       '32 HOSPITAL AND HEALTH FACILITIES          ',
       '35 INDOOR PUBLIC AND CULTURAL FACILITIES   ',
       '36 OUTDOOR RECREATIONAL FACILITIES         ',
       '39 TRANSPORTATION FACILITIES               ',
       '43 CONDO OFFICE BUILDINGS                  ',
       '46 CONDO STORE BUILDINGS                   ',
       '38 ASYLUMS AND HOMES                       ',
       '40 SELECTED GOVERNMENTAL FACILITIES        ',
       '34 THEATRES                                ',
       '15 CONDOS - 2-10 UNIT RESIDENTIAL          ',
       '01  ONE FAMILY DWELLINGS                    ',
       '02  TWO FAMILY DWELLINGS                    ',
       '03  THREE FAMILY DWELLINGS                  ',
       '05  TAX CLASS 1 VACANT LAND                 ',
       '06  TAX CLASS 1 - OTHER                     ',
       '07  RENTALS - WALKUP APARTMENTS             ',
       '08  RENTALS - ELEVATOR APARTMENTS           ',
       '10  COOPS - ELEVATOR APARTMENTS             ',
       '14  RENTALS - 4-10 UNIT                     ',
       '22  STORE BUILDINGS                         ',
       '27  FACTORIES                               ',
       '29  COMMERCIAL GARAGES                      ',
       '30  WAREHOUSES                              ',
       '31  COMMERCIAL VACANT LAND                  ',
       '32  HOSPITAL AND HEALTH FACILITIES          ',
       '37  RELIGIOUS FACILITIES                    ',
       '41  TAX CLASS 4 - OTHER                     ',
       '04  TAX CLASS 1 CONDOS                      ',
       '21  OFFICE BUILDINGS                        ',
       '35  INDOOR PUBLIC AND CULTURAL FACILITIES   ',
       '44  CONDO PARKING                           ',
       '09  COOPS - WALKUP APARTMENTS               ',
       '33  EDUCATIONAL FACILITIES                  ',
       '43  CONDO OFFICE BUILDINGS                  ',
       '12  CONDOS - WALKUP APARTMENTS              ',
       '13  CONDOS - ELEVATOR APARTMENTS            ',
       '36  OUTDOOR RECREATIONAL FACILITIES         ',
       '38  ASYLUMS AND HOMES                       ',
       '11  SPECIAL CONDO BILLING LOTS              ',
       '11A CONDO-RENTALS                           ',
       '47  CONDO NON-BUSINESS STORAGE              ',
       '23  LOFT BUILDINGS                          ',
       '15  CONDOS - 2-10 UNIT RESIDENTIAL          ',
       '26  OTHER HOTELS                            ',
       '46  CONDO STORE BUILDINGS                   ',
       '18  TAX CLASS 3 - UNTILITY PROPERTIES       ',
       '17  CONDO COOPS                             ',
       '34  THEATRES                                ',
       '40  SELECTED GOVERNMENTAL FACILITIES        ',
       '39  TRANSPORTATION FACILITIES               ',
       '28  COMMERCIAL CONDOS                       ',
       '01  ONE FAMILY HOMES                        ',
       '02  TWO FAMILY HOMES                        ',
       '03  THREE FAMILY HOMES                      ',
       '18  TAX CLASS 3 - UTILITY PROPERTIES        ',
       '17  CONDOPS                                 ',
       '                                            ',
       '24  TAX CLASS 4 - UTILITY BUREAU PROPERTIES ',
       '16  CONDOS - 2-10 UNIT WITH COMMERCIAL UNIT ',
       '25  LUXURY HOTELS                           ',
       '49  CONDO WAREHOUSES/FACTORY/INDUS          ',
       '42  CONDO CULTURAL/MEDICAL/EDUCATIONAL/ETC  ',
       '48  CONDO TERRACES/GARDENS/CABANAS          ',
       '49 CONDO WAREHOUSES/FACTORY/INDUS          ',
       '48 CONDO TERRACES/GARDENS/CABANAS          ',
       '16 CONDOS - 2-10 UNIT WITH COMMERCIAL UNIT ',
       '45  CONDO HOTELS                            ',
       '47 CONDO NON-BUSINESS STORAGE              ',
       '28 COMMERCIAL CONDOS                       ',
       '42 CONDO CULTURAL/MEDICAL/EDUCATIONAL/ETC  ',
       '26 OTHER HOTELS                            ',
       '23 LOFT BUILDINGS                          ',
       '45 CONDO HOTELS                            ',
       '25 LUXURY HOTELS                           ',
       '11 SPECIAL CONDO BILLING LOTS              '], dtype=object)

In [ ]:
city_df.columns

Index(['Borough', 'Neighborhood', 'Building_Class_Category', 'Address',
       'Apartment_Number', 'Zip_Code', 'Residential_Units',
       'Gross_Square_Feet', 'Sale_Price', 'Sale_Date', 'Year', 'Month'],
      dtype='object')

In [ ]:
# check if Residential_Units > 0 filters out non residential building class categories

# codes of unique building categories for whole df
total_cat = city_df.Building_Class_Category.str[:2].unique().tolist()

# codes of unique building categories where Residential_Units > 0
res_filtered = city_df[(city_df.Residential_Units > 0)]
res_filtered = res_filtered.Building_Class_Category.str[:2].unique().tolist()

# list of codes in total_cat not in res_filtered
res_class = [x for x in total_cat if x not in res_filtered]
print(res_class)

# Residential_Unites > 0 does not filter out non residential building class categories

['47', '18', '24', '49', '42', '45']

In [ ]:
# drop Residential_Units Column
city_df.drop('Residential_Units', axis=1, inplace=True)

In [ ]:
# drop rows with sqf == 0
city_df = city_df[(city_df.Gross_Square_Feet > 0)]

In [ ]:
 # drop rows with prive < 1000
 city_df = city_df[(city_df.Sale_Price > 1000)]

In [ ]:
# filter for target residential_classes
residential_classes = ["01", "02", "03", "04", "06", "07", "08", "09", "10", "11", 
                         "12", "13", "14", "15", "16", "17", "23", "45", "49"]
city_df = city_df[city_df["Building_Class_Category"].str[:2].isin(residential_classes)]

In [ ]:
city_df.Building_Class_Category.unique()

array(['01 ONE FAMILY DWELLINGS                    ',
       '02 TWO FAMILY DWELLINGS                    ',
       '03 THREE FAMILY DWELLINGS                  ',
       '07 RENTALS - WALKUP APARTMENTS             ',
       '14 RENTALS - 4-10 UNIT                     ',
       '08 RENTALS - ELEVATOR APARTMENTS           ',
       '09 COOPS - WALKUP APARTMENTS               ',
       '10 COOPS - ELEVATOR APARTMENTS             ',
       '06 TAX CLASS 1 - OTHER                     ',
       '01  ONE FAMILY DWELLINGS                    ',
       '02  TWO FAMILY DWELLINGS                    ',
       '03  THREE FAMILY DWELLINGS                  ',
       '07  RENTALS - WALKUP APARTMENTS             ',
       '08  RENTALS - ELEVATOR APARTMENTS           ',
       '14  RENTALS - 4-10 UNIT                     ',
       '10  COOPS - ELEVATOR APARTMENTS             ',
       '23  LOFT BUILDINGS                          ',
       '06  TAX CLASS 1 - OTHER                     ',
       '09  COOPS - WALKUP APARTMENTS               ',
       '11A CONDO-RENTALS                           ',
       '01  ONE FAMILY HOMES                        ',
       '02  TWO FAMILY HOMES                        ',
       '03  THREE FAMILY HOMES                      ',
       '17  CONDOPS                                 ',
       '13  CONDOS - ELEVATOR APARTMENTS            ',
       '11  SPECIAL CONDO BILLING LOTS              ',
       '23 LOFT BUILDINGS                          ',
       '17  CONDO COOPS                             ',
       '15  CONDOS - 2-10 UNIT RESIDENTIAL          ',
       '12  CONDOS - WALKUP APARTMENTS              ',
       '17 CONDO COOPS                             '], dtype=object)

In [ ]:
# dataframe with upper and lower quantile for each borough and year
city_df["$sqf"] = city_df["Sale_Price"]/city_df["Gross_Square_Feet"]
lower_quant = city_df.groupby(["Borough", "Year"])["$sqf"].quantile(0.05)
upper_quant = city_df.groupby(["Borough", "Year"])["$sqf"].quantile(0.95)
quant_df = pd.concat([lower_quant, upper_quant], join="outer",axis=1, keys=["lower", "upper"])
quant_df.head()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

                  lower        upper
Borough Year
1       2003   2.654499  1005.813794
        2004   2.246501  1156.235091
        2005  11.591491  1289.434669
        2006  12.674950  1441.084313
        2007  28.830715  1960.421904

In [ ]:
city_df[["Year", "$sqf"]].groupby(["Year"]).describe()

         $sqf                            ...
        count        mean           std  ...         50%         75%        max
Year                                     ...
2003  42135.0  302.446166  10797.880889  ...  175.177305  233.198952  1500000.0
2004  46818.0  346.431602  19802.950856  ...  204.761498  268.419410  3800000.0
2005  45309.0  559.950528  26218.737183  ...  240.590184  314.655172  3914950.0
2006  40835.0  448.786294  15580.248035  ...  263.333333  341.513284  2343819.0
2007  31843.0  471.269356  13785.236745  ...  270.292208  355.337931  1900000.0
2008  23683.0  368.584505  13052.405090  ...  251.666667  333.846198  2000000.0
2009  20664.0  303.143110   7547.814070  ...  230.983922  309.214623  1085000.0
2010  21189.0  424.173102   9035.117068  ...  228.812500  312.500000   690000.0
2011  19060.0  281.949256   2040.796368  ...  225.000000  311.856942   232500.0
2012  21548.0  309.167406   3670.432499  ...  231.812188  325.592569   515125.0
2013  24997.0  299.830356   1706.852392  ...  242.857143  340.111643   260000.0
2014  26069.0  399.254612   9508.592483  ...  262.054507  370.166960  1350000.0
2015  27493.0  399.670226   6037.678141  ...  302.219980  425.000000   999000.0
2016  27819.0  376.738371   1286.463070  ...  309.244792  439.249608   192500.0
2017  28290.0  461.992825   8479.702286  ...  356.594080  496.981415  1425550.0

[15 rows x 8 columns]

In [ ]:
# Adding columns with upper and lower $/sqf quantiles 
city_df["Lower_Quant"] = city_df.groupby(["Borough", "Year"])["$sqf"].transform(lambda x: x.quantile(0.05))
city_df["Upper_Quant"] = city_df.groupby(["Borough", "Year"])["$sqf"].transform(lambda x: x.quantile(0.95))
city_df.shape

(447752, 14)

In [ ]:
# properties filtered out by quantiles
rejected = city_df[(city_df["$sqf"]<city_df["Lower_Quant"]) | (city_df["$sqf"]>city_df["Upper_Quant"])]
rejected.head()

    Borough Neighborhood  ... Lower_Quant Upper_Quant
4         2     BATHGATE  ...   90.414954  435.535714
9         2     BATHGATE  ...   90.414954  435.535714
21        2     BATHGATE  ...   90.414954  435.535714
28        2     BATHGATE  ...   90.414954  435.535714
77        2   BAYCHESTER  ...   90.414954  435.535714

[5 rows x 14 columns]

In [ ]:
# Select values that fall between quantiles
city_df = city_df[(city_df["$sqf"]>city_df["Lower_Quant"]) & (city_df["$sqf"]<city_df["Upper_Quant"])]
city_df.shape

(402900, 14)

In [ ]:
city_df[["Year", "$sqf"]].groupby(["Year"]).describe()

         $sqf                          ...
        count        mean         std  ...         50%         75%          max
Year                                   ...
2003  37915.0  180.934275   77.161598  ...  175.175175  225.903614  1005.373303
2004  42132.0  211.602749   86.971465  ...  204.761498  260.416667  1150.793651
2005  40773.0  249.220193   96.635548  ...  240.590184  305.357143  1285.027696
2006  36747.0  272.436045  104.087554  ...  263.333333  331.833400  1440.635867
2007  28654.0  286.004425  132.613050  ...  270.284185  344.387755  1959.459459
2008  21308.0  267.540801  132.070075  ...  251.666667  323.832960  2083.333333
2009  18594.0  242.942032  112.878709  ...  230.983922  299.744898  1771.703366
2010  19062.0  245.659918  135.267597  ...  228.800019  302.036757  1973.886329
2011  17149.0  244.532723  138.108457  ...  225.000000  300.000000  1800.271739
2012  19390.0  258.790425  164.544312  ...  231.812188  313.617103  2074.652778
2013  22494.0  269.832400  163.905765  ...  242.857143  327.920790  2091.562963
2014  23455.0  296.653240  190.609556  ...  262.054507  357.394446  2511.666209
2015  24739.0  343.025755  220.461010  ...  302.219980  409.530303  2930.360309
2016  25033.0  346.738060  196.133698  ...  309.244792  422.705314  2582.417582
2017  25455.0  393.036586  205.633262  ...  356.617647  478.535963  2968.750000

[15 rows x 8 columns]

In [ ]:
# of duplicated_addresses
duplicated_address = city_df["Address"][(city_df["Address"].duplicated()==True)]
duplicated_address.shape

(72585,)

In [ ]:
# number of apartments can't fill duplicated addresses
apt_df = city_df["Apartment_Number"].unique()
apt_df.shape

(294,)

In [ ]:
city_df.drop(["Apartment_Number"], axis=1)

         Borough Neighborhood  ... Lower_Quant Upper_Quant
1              2     BATHGATE  ...   90.414954  435.535714
2              2     BATHGATE  ...   90.414954  435.535714
3              2     BATHGATE  ...   90.414954  435.535714
5              2     BATHGATE  ...   90.414954  435.535714
6              2     BATHGATE  ...   90.414954  435.535714
...          ...          ...  ...         ...         ...
1432449        5      WOODROW  ...  142.045455  562.333960
1432450        5      WOODROW  ...  142.045455  562.333960
1432451        5      WOODROW  ...  142.045455  562.333960
1432452        5      WOODROW  ...  142.045455  562.333960
1432453        5      WOODROW  ...  142.045455  562.333960

[402900 rows x 13 columns]

In [ ]:
# checking for null values
na = city_df.set_index(["Borough"]).isna().sum(level=0)
na.head()

         Neighborhood  Building_Class_Category  ...  Lower_Quant  Upper_Quant
Borough                                         ...
2                   0                        0  ...            0            0
3                   0                        0  ...            0            0
1                   0                        0  ...            0            0
4                   0                        0  ...            0            0
5                   0                        0  ...            0            0

[5 rows x 13 columns]

In [ ]:
city_df.reset_index(inplace=True)

In [ ]:
address_df = city_df[["Address", "Building_Class_Category", "Borough", "Neighborhood", 
                     "Zip_Code"]]
sale_df = city_df[["Gross_Square_Feet", "Sale_Price", "Sale_Date", "Year"]]

In [ ]:
# writing tables to sql/csv
address_df.to_sql(name='Address', con=engine, method='multi', if_exists='replace')
#sale_df.to_csv("NY_Propety_Sales_Table.csv")
sale_df.to_sql(name='Sales', con=engine, method='multi', if_exists='replace')
#address_df.to_csv("NY_Property_Address_Table.csv")

In [ ]:
#rejected.to_csv("Price_Outliers.csv")